# Height Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarContainerItem..::..Height Property
RebarContainerItem Class See Also
---
For a spiral, the overall height.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double Height { get; set; }
```

Visual Basic
---
```text
Public Property Height As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Height {
	double get ();
	void set (double value);
}
```

# Remarks
Applies only to instances where RebarShape.Definition is of type RebarShapeDefinitionByArc, and its Type property is equal to the value RebarShapeDefinitionByArcType.Spiral.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: height must be positive. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This RebarContainerItem is not an instance of a spiral shape. |

# See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace